'use client'

export default function HelloMessage() {
  console.log(`┌───────────────────────────────────────────────────────────────────────────┐
  │███████╗██╗  ██╗██████╗ ██╗███╗   ███╗██████╗     ██████╗ ███████╗██╗   ██╗│
  │██╔════╝██║  ██║██╔══██╗██║████╗ ████║██╔══██╗    ██╔══██╗██╔════╝██║   ██║│
  │███████╗███████║██████╔╝██║██╔████╔██║██████╔╝    ██║  ██║█████╗  ██║   ██║│
  │╚════██║██╔══██║██╔══██╗██║██║╚██╔╝██║██╔═══╝     ██║  ██║██╔══╝  ╚██╗ ██╔╝│
  │███████║██║  ██║██║  ██║██║██║ ╚═╝ ██║██║         ██████╔╝███████╗ ╚████╔╝ │
  │╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝╚═╝     ╚═╝╚═╝         ╚═════╝ ╚══════╝  ╚═══╝  │
  └───────────────────────────────────────────────────────────────────────────┘`)

  console.log(`🦐 "Você está cansado de peixes que fazem piadas ruins? Experimente nossos camarões, o verdadeiro showstopper do oceano! Nossos amigos marinhos são tão deliciosos que até o Nemo faria um 'shrimptastic'! 🌊

  Não há 'pegadinhas' aqui, só camarões suculentos e saborosos. Dê uma chance a eles e torne-se um verdadeiro 'shrimp lover'. Junte-se a nós e embarque nesta 'sea-nema' deliciosa!
  
  Com amor (e camarões),
  Shrimp Dev 🦐"`)
  
  return null
}
